src/cf/AccumulationRegisters/РасчетыПоНалогамНаЕдиномНалоговомСчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоНалогамНаЕдиномНалоговомСчете</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежейВБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокУплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штраф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыСвышеПредела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыБезСпецоценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосрегистрацияОрганизацийЧерезМФЦ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПрибылиИУбытки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПрибылиИУбытки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрибыльУбытокОтПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СальдоПрочихДоходовИРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧрезвычайныеДоходыРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыеСанкции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/НалогНаПрофессиональныйДоход/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьТаблицуПроводокНачисленияНалога(Реквизиты) Экспорт
	
	Если ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Реквизиты.Организация)
		Или Не УчетнаяПолитика.ПрименяетсяНалогНаПрофессиональныйДоходЗаПериод(
			Реквизиты.Организация, Реквизиты.НачалоПериода, Реквизиты.КонецПериода) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НалогУплаченный = НалогУплаченный(
		Реквизиты.Организация,
		Реквизиты.НачалоПериода,
		Реквизиты.КонецПериода,
		Реквизиты.Регистратор);
	
	ТаблицаПроводок = НоваяТаблицаПроводок();
	
	Если НалогУплаченный > 0 Тогда
		
		ПараметрыПроводки = ТаблицаПроводок.Добавить();
		ЗаполнитьЗначенияСвойств(ПараметрыПроводки, Реквизиты);
		
		ПараметрыПроводки.СчетУчетаНалога = ПланыСчетов.Хозрасчетный.НалогНаПрофессиональныйДоход;
		ПараметрыПроводки.ВидыПлатежейВГосБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		
		ПараметрыПроводки.СчетУчетаРасходов = ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД;
		ПараметрыПроводки.ПрибылиИУбытки = Перечисления.ПрибылиИУбытки.НалогНаПрибыль;
	
		ПараметрыПроводки.Сумма = 
			НалогУплаченный(Реквизиты.Организация, Реквизиты.НачалоПериода, Реквизиты.КонецПериода, Реквизиты.Регистратор);
		
		ПараметрыПроводки.Содержание = НСтр(
			"ru = 'Отражен расход по Налогу на профессиональный доход'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецЕсли;
	
	Возврат ТаблицаПроводок;
	
КонецФункции

Процедура СформироватьДвиженияНачисленияНалога(ТаблицаПроводок, Движения, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаПроводок) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПараметрыПроводки Из ПодготовитьПараметрыДвиженияНачисленияНалога(ТаблицаПроводок).Проводки Цикл
		
		Проводка = Движения.Хозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, ПараметрыПроводки);
		
		Проводка.СчетДт = ПараметрыПроводки.СчетУчетаРасходов;
		БухгалтерскийУчет.УстановитьСубконто(
			Проводка.СчетДт,
			Проводка.СубконтоДт,
			"ПрибылиИУбытки",
			ПараметрыПроводки.ПрибылиИУбытки);
		
		Проводка.СчетКт = ПараметрыПроводки.СчетУчетаНалога;
		БухгалтерскийУчет.УстановитьСубконто(
			Проводка.СчетКт,
			Проводка.СубконтоКт,
			"ВидыПлатежейВГосБюджет",
			ПараметрыПроводки.ВидыПлатежейВГосБюджет);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьПараметрыДвиженияНачисленияНалога(ТаблицаПроводок)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Проводки
	
	СписокОбязательныхКолонок = ""
		+ "Период," // <Дата> - период движений - дата документа
		+ "Регистратор," // <ДокументСсылка.*> - документ-регистратор движений
		+ "Организация," // <СправочникСсылка.Организации> - оранизация
		+ "СчетУчетаНалога," // <ПланСчетовСсылка.Хозрасчетный> - счет учета налога
		+ "ВидыПлатежейВГосБюджет," // <"ПеречислениеСсылка.ВидыПлатежейВГосБюджет>
		+ "СчетУчетаРасходов," // <ПланСчетовСсылка.Хозрасчетный> - счет учета расходов
		+ "ПрибылиИУбытки," // <"ПеречислениеСсылка.ПрибылиИУбытки>
		+ "Сумма," // <Число, 15, 2>
		+ "Содержание"; // <Строка>
	
	Проводки = ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаПроводок,
		СписокОбязательныхКолонок);
		
	Параметры.Вставить("Проводки", Проводки);
	
	Возврат Параметры;
	
КонецФункции

Функция НоваяТаблицаПроводок()
	
	ТаблицаПроводок = Новый ТаблицаЗначений();
	ТаблицаПроводок.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаПроводок.Колонки.Добавить("Регистратор", Документы.ТипВсеСсылки());
	ТаблицаПроводок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	ТаблицаПроводок.Колонки.Добавить("СчетУчетаНалога", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаПроводок.Колонки.Добавить("ВидыПлатежейВГосБюджет",
		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПлатежейВГосБюджет"));
	
	ТаблицаПроводок.Колонки.Добавить("СчетУчетаРасходов", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаПроводок.Колонки.Добавить("ПрибылиИУбытки", Новый ОписаниеТипов("ПеречислениеСсылка.ПрибылиИУбытки"));
	
	ТаблицаПроводок.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	ТаблицаПроводок.Колонки.Добавить("Содержание", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Возврат ТаблицаПроводок;
	
КонецФункции

Функция НалогУплаченный(Организация, НачалоПериода, КонецПериода, Регистратор = Неопределено)
	
	СчетаУплаты = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУплаты,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Касса));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУплаты,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетныеСчета));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУплаты,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ЦифровойРубль));
	
	ПлательщикЕНП = УчетнаяПолитика.ПлательщикЕНП(Организация, КонецПериода);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетаУплаты", СчетаУплаты);
	Запрос.УстановитьПараметр("СчетУчетаНалога", ПланыСчетов.Хозрасчетный.НалогНаПрофессиональныйДоход);
	Запрос.УстановитьПараметр("ВидыСубконтоСчетаУчетаНалога",
		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет);
	Запрос.УстановитьПараметр("ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Если Регистратор = Неопределено Тогда
		Если КонецПериода < НачалоПериода Тогда
			Возврат Неопределено;
		КонецЕсли;
		Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецПериода, ВидГраницы.Включая));
	Иначе
		МоментВремени = Регистратор.МоментВремени();
		Если МоментВремени.Дата < НачалоПериода Тогда
			Возврат Неопределено;
		КонецЕсли;
		Запрос.УстановитьПараметр("КонецПериода", Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Исключая));
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			СчетДт = &СчетУчетаНалога,
		|			&ВидыСубконтоСчетаУчетаНалога,
		|			СчетКт В (&СчетаУплаты),
		|			,
		|			Организация = &Организация
		|				И СубконтоДт1 = &ВидыПлатежейВГосБюджет) КАК ХозрасчетныйОборотыДтКт";
	
	Если ПлательщикЕНП Тогда
		ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" +
			"ВЫБРАТЬ
			|	РасчетыПоНалогамНаЕдиномНалоговомСчетеОбороты.СуммаРасход
			|ИЗ
			|	РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			,
			|			СчетУчета = &СчетУчетаНалога
			|				И Организация = &Организация
			|				И ГоловнаяОрганизация = &Организация) КАК РасчетыПоНалогамНаЕдиномНалоговомСчетеОбороты";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("Сумма");
	
КонецФункции

#КонецОбласти
